Repository: oliverzhou2030/GroceryTool-AI
Catalog: GroceryToolAI/GroceryToolAI/Localizable.xcstrings
Source language: en
Languages: es, zh_hans

source: Account
es: Cuenta
zh_hans: 账户

source: All insights use this range.
es: Todos los datos usan este período.
zh_hans: 所有分析均使用此日期范围。

source: Analysis period
es: Período de análisis
zh_hans: 分析日期范围

source: App language
es: Idioma de la app
zh_hans: 应用语言

source: Appearance
es: Apariencia
zh_hans: 外观

source: Bar
es: Barras
zh_hans: 条形图

source: Calendar
es: Calendario
zh_hans: 日历

source: Category corrections
es: Correcciones de categoría
zh_hans: 类别更正

source: Chart style
es: Tipo de gráfico
zh_hans: 图表类型

source: Choose a wider date range or add a receipt.
es: Elige un período más amplio o añade un recibo.
zh_hans: 请选择更长的日期范围或添加收据。

source: Color mode
es: Modo de color
zh_hans: 颜色模式

source: Current location
es: Ubicación actual
zh_hans: 当前位置

source: Export CSV
es: Exportar CSV
zh_hans: 导出 CSV

source: Favorite store
es: Tienda favorita
zh_hans: 常用商店

source: Food : snack
es: Comida : aperitivos
zh_hans: 食品：零食

source: Food spending
es: Gasto por alimento
zh_hans: 食品支出

source: Food types
es: Tipos de alimentos
zh_hans: 食品类别

source: From
es: Desde
zh_hans: 开始

source: Insights
es: Análisis
zh_hans: 分析

source: Language
es: Idioma
zh_hans: 语言

source: Language changes apply immediately.
es: Los cambios de idioma se aplican de inmediato.
zh_hans: 语言更改会立即生效。

source: Learned preferences
es: Preferencias aprendidas
zh_hans: 已学习偏好

source: Markets
es: Tiendas
zh_hans: 商店

source: Name
es: Nombre
zh_hans: 姓名

source: No receipt data
es: No hay datos de recibos
zh_hans: 没有收据数据

source: Number of purchased items
es: Cantidad de artículos comprados
zh_hans: 购买商品数量

source: Pie
es: Circular
zh_hans: 饼图

source: Plans selected
es: Planes seleccionados
zh_hans: 已选择方案

source: Privacy
es: Privacidad
zh_hans: 隐私

source: Receipts
es: Recibos
zh_hans: 收据

source: Settings
es: Ajustes
zh_hans: 设置

source: Share of item spending by food type
es: Proporción del gasto por tipo de alimento
zh_hans: 各食品类别的支出比例

source: Share of total spending
es: Proporción del gasto total
zh_hans: 总支出比例

source: Shop
es: Comprar
zh_hans: 购物

source: Sign out
es: Cerrar sesión
zh_hans: 退出登录

source: Spending insights
es: Análisis de gastos
zh_hans: 支出分析

source: Through
es: Hasta
zh_hans: 结束

source: Total spent
es: Gasto total
zh_hans: 总支出

source: Username
es: Usuario
zh_hans: 用户名
